In [1]:
import numpy as np
import pandas as pd

In [2]:
s = pd.Series([300,250,500,400], index = [['전자제품','전자제품','식품','식품'],['노트북','휴대폰','라면','과자']])
s

전자제품  노트북    300
      휴대폰    250
식품    라면     500
      과자     400
dtype: int64

In [17]:
print(s.loc['전자제품'])
print(s.loc[('식품', '라면')])

노트북    300
휴대폰    250
dtype: int64
500

In [18]:
s = pd.Series([40,35,50,45], 
              index = [['1학년', '1학년','2학년', '2학년'], 
                       ['국어','수학','국어','수학']])
s

1학년  국어    40
     수학    35
2학년  국어    50
     수학    45
dtype: int64

In [21]:
print(s['1학년'])
print(s.loc[('2학년','수학')])

국어    40
수학    35
dtype: int64
45

In [29]:
df = pd.DataFrame( [[120, 45],[95, 60],[150, 70],[110, 55]],
                   index =[ ['중앙도서관','중앙도서관','시립도서관','시립도서관'] ,
                            ['1월','2월','1월','2월'] ],
                   columns = ['소설','과학']  )
df

           소설  과학
중앙도서관 1월  120  45
      2월   95  60
시립도서관 1월  150  70
      2월  110  55

In [33]:
# 데이터프레임에서 데이터 꺼내기
# 중앙도서관의 전체 대출 건수 조회
print(df.index)
print(df.columns)
print(df.loc['중앙도서관'])
# 시립도서관의 2월 과학 카테고리의 대출 건수 조회
print(df.loc[('시립도서관','2월'), '과학'])

MultiIndex([('중앙도서관', '1월'),
            ('중앙도서관', '2월'),
            ('시립도서관', '1월'),
            ('시립도서관', '2월')],
           )
Index(['소설', '과학'], dtype='object')
     소설  과학
1월  120  45
2월   95  60
55

In [35]:
df = pd.DataFrame([[320, 280],[210, 230],[400, 390],[180, 200]], 
                  index = [ [ '2022년','2022년','2023년','2023년' ], 
                            [ 'suv','세단','suv','세단' ] ], columns = ['1분기','2분기'])
df

           1분기  2분기
2022년 suv  320  280
      세단   210  230
2023년 suv  400  390
      세단   180  200

In [38]:
print(df.loc['2022년'])
print(df.loc[('2023년','세단'), '2분기'])

     1분기  2분기
suv  320  280
세단   210  230
200

In [43]:
df = pd.DataFrame([ [ 45, 30 ], [ 50, 35 ], [ 60, 40 ], [ 55, 38 ] ],
                  index = [ [ '서울지점', '서울지점', '부산지점', '부산지점' ],
                            [ '7월', '8월', '7월', '8월' ] ],
                  columns = [ '싱글룸', '더블룸' ])
df

         싱글룸  더블룸
서울지점 7월   45   30
     8월   50   35
부산지점 7월   60   40
     8월   55   38

In [45]:
print(df.loc['서울지점'])
print(df.loc[('부산지점', '8월')])

    싱글룸  더블룸
7월   45   30
8월   50   35
싱글룸    55
더블룸    38
Name: (부산지점, 8월), dtype: int64

In [47]:
df = pd.DataFrame( [ [ 120, 140 ], [ 80, 95 ], [ 200, 220 ], [ 150, 160 ] ],
                   index = [ [ '가전', '가전', '식품', '식품' ],
                             [ '노트북', '청소기', '라면', '과자' ] ], columns = [ '1월', '2월' ] )
df

         1월   2월
가전 노트북  120  140
   청소기   80   95
식품 라면   200  220
   과자   150  160

In [49]:
print(df.loc['가전'])
print(df.loc[('식품','라면'),'2월'])

      1월   2월
노트북  120  140
청소기   80   95
220

In [64]:
# 1.
df1 = pd.DataFrame({'고객ID' : [101,102,103], '이름' : ['철수','영희','민수']})
df2 = pd.DataFrame({'고객ID' : [101,104,102], '상품' : ['노트북','청소기','책']})
# 2.
df3 = pd.DataFrame({'사번' : [1,2,3], '이름' : ['홍길동','임꺽정','이몽룡']})
df4 = pd.DataFrame({'사번' : [1,3], '부서' : ['영업','개발']})
# 3.
df5 = pd.DataFrame({'상품코드' : ['A1','A2','A3'], '상품명' : ['노트북','청소기','책상']})
df6 = pd.DataFrame({'상품코드' : ['A2','A3','A4'], '재고' : [5,8,10]})
# 4.
df7 = pd.DataFrame({'학번' : [1,2,3], '이름' : ['지훈','서연','민지']})
df8 = pd.DataFrame({'학번' : [2,4], '동아리' : ['축구부','합창단']})

In [51]:
df1

   고객ID  이름
0   101  철수
1   102  영희
2   103  민수

In [52]:
df2

   고객ID   상품
0   101  노트북
1   104  청소기
2   102    책

In [54]:
pd.merge(df1, df2, on = '고객ID')

   고객ID  이름   상품
0   101  철수  노트북
1   102  영희    책

In [55]:
df3

   사번   이름
0   1  홍길동
1   2  임꺽정
2   3  이몽룡

In [56]:
df4

   사번  부서
0   1  영업
1   3  개발

In [57]:
pd.merge(df3, df4, on = '사번', how = 'left')

   사번   이름   부서
0   1  홍길동   영업
1   2  임꺽정  NaN
2   3  이몽룡   개발

In [58]:
df5

  상품코드  상품명
0   A1  노트북
1   A2  청소기
2   A3   책상

In [59]:
df6

  상품코드  재고
0   A2   5
1   A3   8
2   A4  10

In [60]:
pd.merge(df5, df6, on = '상품코드', how = 'right')

  상품코드  상품명  재고
0   A2  청소기   5
1   A3   책상   8
2   A4  NaN  10

In [61]:
df7

   학번  이름
0   1  지훈
1   2  서연
2   3  민지

In [62]:
df8

   학번  동아리
0   2  축구부
1   4  합창단

In [63]:
pd.merge(df7, df8, on = '학번', how = 'outer')

   학번   이름  동아리
0   1   지훈  NaN
1   2   서연  축구부
2   3   민지  NaN
3   4  NaN  합창단

In [70]:
df1 = pd.DataFrame({'사번' : [1,2], '이름' : ['홍길동','임꺽정']})
df2 = pd.DataFrame({'부서' : ['영업','개발']})

df3 = pd.DataFrame({'매출' : [100,200]})
df4 = pd.DataFrame({'매출' : [150,250]})
df5 = pd.DataFrame({'매출' : [300,400]})

df6 = pd.DataFrame({'이름' : ['철수', '영희'], '국어' : [85, 90]})
df7 = pd.DataFrame({'이름' : ['민수', '지연'], '수학' : [78, 92]})

In [66]:
pd.concat([df1, df2], axis = 1)

   사번   이름  부서
0   1  홍길동  영업
1   2  임꺽정  개발

In [69]:
pd.concat([df3,df4,df5], ignore_index=True)

    매출
0  100
1  200
2  150
3  250
4  300
5  400

In [71]:
pd.concat([df6, df7], axis = 1)

   이름  국어  이름  수학
0  철수  85  민수  78
1  영희  90  지연  92

In [82]:
df1 = pd.DataFrame({'카테고리' : ['식품','식품','가전','가전'],
                   '월' : ['1월','2월','1월','2월'],
                   '매출' : [200,250,500,550]})
df2 = pd.DataFrame({'도서관' : ['중앙','중앙','시립','시립'],
                    '장르' : ['소설','과학','소설','과학'],
                    '대출건수' : [120,45,95,60]})
df3 = pd.DataFrame({'지점' : ['서울','서울','부산','부산'],
                    '객실유형' : ['싱글룸','더블룸','싱글룸','더블룸'],
                    '예약건수' : [45,30,50,35]})

In [88]:
result1 = df1.pivot(index = '카테고리', columns = '월', values = '매출')
result1

월      1월   2월
카테고리
가전    500  550
식품    200  250

In [87]:
result2 = df2.pivot(index = '도서관', columns = '장르', values = '대출건수')
result2

장르   과학   소설
도서관
시립   60   95
중앙   45  120

In [85]:
result3 = df3.pivot(index = '지점', columns = '객실유형', values = '예약건수')
result3

객실유형  더블룸  싱글룸
지점
부산     35   50
서울     30   45